export interface Question {
  id: number;
  levelId: number;
  question: string;
  answer: string;
  points: number;
}

export const levels = [
  { id: 1, title: 'مستوى سهل' },
  { id: 2, title: 'مستوى متوسط' },
  { id: 3, title: 'مستوى صعب' },
];

export const questions: Question[] = [
  {
    "id": 1,
    "levelId": 1,
    "question": "ما هي أول كلمات إنجيل مارمرقس؟",
    "answer": "بدء إنجيل يسوع المسيح ابن الله",
    "points": 100
  },
  {
    "id": 2,
    "levelId": 1,
    "question": "من هو الذي كان يعمد في البرية ويكرز بمعمودية التوبة؟",
    "answer": "يوحنا المعمدان",
    "points": 200
  },
  {
    "id": 3,
    "levelId": 1,
    "question": "ماذا كان يلبس يوحنا المعمدان؟",
    "answer": "وبر الإبل ومنطقة من جلد على حقويه",
    "points": 300
  },
  {
    "id": 4,
    "levelId": 1,
    "question": "ماذا كان طعام يوحنا المعمدان؟",
    "answer": "جراداً وعسلاً برياً",
    "points": 400
  },
  {
    "id": 5,
    "levelId": 1,
    "question": "أين تعمد يسوع المسيح؟",
    "answer": "في نهر الأردن",
    "points": 500
  },
  {
    "id": 6,
    "levelId": 1,
    "question": "ماذا رأى يسوع عند صعوده من الماء في المعمودية؟",
    "answer": "السموات قد انشقت والروح مثل حمامة نازلاً عليه",
    "points": 600
  },
  {
    "id": 7,
    "levelId": 1,
    "question": "كم يوماً قضاها يسوع في البرية يُجرب من الشيطان؟",
    "answer": "أربعين يوماً",
    "points": 700
  },
  {
    "id": 8,
    "levelId": 1,
    "question": "من هما أول تلميذين دعاهما يسوع وكانا يلقيان شبكة في البحر؟",
    "answer": "سمعان وأندراوس أخوه",
    "points": 800
  },
  {
    "id": 9,
    "levelId": 1,
    "question": "من كان الجالس عند مكان الجباية ودعاه يسوع ليتبعه؟",
    "answer": "لاوي بن حلفى (متى)",
    "points": 900
  },
  {
    "id": 10,
    "levelId": 1,
    "question": "ماذا كان يفعل يسوع في المؤخرة أثناء العاصفة العظيمة في البحر؟",
    "answer": "نائماً على وسادة",
    "points": 1000
  },
  {
    "id": 11,
    "levelId": 2,
    "question": "من هو النبي الذي اقتبس منه مارمرقس نبوة (هاءنذا أرسل أمام وجهك ملاكي)؟",
    "answer": "إشعياء النبي (وملاخي)",
    "points": 100
  },
  {
    "id": 12,
    "levelId": 2,
    "question": "ماذا حدث لحماة سمعان بطرس، وماذا فعلت بعدما شفاها يسوع؟",
    "answer": "كانت محمومة، فشفيت وقامت تخدمهم",
    "points": 200
  },
  {
    "id": 13,
    "levelId": 2,
    "question": "أين كان يسوع يعلم عندما دُلّي المفلوج من السقف؟",
    "answer": "في كفرناحوم (في بيت)",
    "points": 300
  },
  {
    "id": 14,
    "levelId": 2,
    "question": "ماذا قال يسوع للمفلوج أولاً قبل أن يشفيه جسدياً؟",
    "answer": "يا بني مغفورة لك خطاياك",
    "points": 400
  },
  {
    "id": 15,
    "levelId": 2,
    "question": "بماذا شبه يسوع نفسه عندما سألوه عن سبب عدم صوم تلاميذه؟",
    "answer": "بالعريس (هل يستطيع بنو العرس أن يصوموا والعريس معهم؟)",
    "points": 500
  },
  {
    "id": 16,
    "levelId": 2,
    "question": "ماذا فعل تلاميذ يسوع في يوم السبت ولامهم الفريسيون عليه؟",
    "answer": "كانوا يقطفون السنابل",
    "points": 600
  },
  {
    "id": 17,
    "levelId": 2,
    "question": "ماذا كان مرض الرجل في المجمع يوم السبت والذي شفاه يسوع؟",
    "answer": "كانت يده يابسة",
    "points": 700
  },
  {
    "id": 18,
    "levelId": 2,
    "question": "كم عدد التلاميذ الذين اختارهم يسوع ليكونوا معه ويرسلهم ليكرزوا؟",
    "answer": "اثنا عشر تلميذاً",
    "points": 800
  },
  {
    "id": 19,
    "levelId": 2,
    "question": "ما هو الاسم الذي أطلقه يسوع على يعقوب ويوحنا ابني زبدي؟",
    "answer": "بوانرجس (ابني الرعد)",
    "points": 900
  },
  {
    "id": 20,
    "levelId": 2,
    "question": "في مثل الزارع، ماذا حدث للزرع الذي سقط على الطريق؟",
    "answer": "جاءت طيور السماء وأكلته",
    "points": 1000
  },
  {
    "id": 21,
    "levelId": 3,
    "question": "بمن اتهم الكتبة يسوع أنه يخرج الشياطين؟",
    "answer": "ببعلزبول رئيس الشياطين",
    "points": 100
  },
  {
    "id": 22,
    "levelId": 3,
    "question": "من قال عنهم يسوع أنهم (أمه وإخوته) الحقيقيون؟",
    "answer": "من يصنع مشيئة الله",
    "points": 200
  },
  {
    "id": 23,
    "levelId": 3,
    "question": "في مثل الزارع، إلى ماذا يرمز الزرع الذي سقط على الأماكن المحجرة؟",
    "answer": "الذين يسمعون الكلمة ويقبلونها بفرح، ولكن ليس لهم أصل في ذاتهم، فإذا حدث ضيق يعثرون",
    "points": 300
  },
  {
    "id": 24,
    "levelId": 3,
    "question": "في مثل الزارع، إلى ماذا يرمز الزرع الذي سقط بين الشوك؟",
    "answer": "الذين يسمعون الكلمة، وتدخل هموم هذا العالم وغرور الغنى وتخنق الكلمة",
    "points": 400
  },
  {
    "id": 25,
    "levelId": 3,
    "question": "كم كانت نسبة الإثمار للزرع الذي سقط في الأرض الجيدة؟",
    "answer": "ثلاثين وستين ومئة",
    "points": 500
  },
  {
    "id": 26,
    "levelId": 3,
    "question": "بماذا شبه يسوع ملكوت الله في الأصحاح الرابع والذي يبدأ صغيراً جداً؟",
    "answer": "بحبة خردل، أصغر جميع البذور على الأرض، وتنمو لتصير أكبر البقول",
    "points": 600
  },
  {
    "id": 27,
    "levelId": 3,
    "question": "ماذا قال يسوع للبحر الهائج ليسكت العاصفة؟",
    "answer": "اسكت، ابكم",
    "points": 700
  },
  {
    "id": 28,
    "levelId": 3,
    "question": "بماذا وبخ يسوع تلاميذه بعد أن أسكت العاصفة؟",
    "answer": "ما بالكم خائفين هكذا؟ كيف لا إيمان لكم؟",
    "points": 800
  },
  {
    "id": 29,
    "levelId": 3,
    "question": "ما هي القرية التي كان يسوع يكرز في مجامعها عندما شفا الأبرص في الأصحاح الأول؟",
    "answer": "في كل الجليل",
    "points": 900
  },
  {
    "id": 30,
    "levelId": 3,
    "question": "ماذا طلب يسوع من الأبرص بعدما شفاه؟",
    "answer": "أن لا يقل لأحد شيئاً، بل يري نفسه للكاهن ويقدم عن تطهيره ما أمر به موسى",
    "points": 1000
  }
];
